n5/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerVATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Export</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Import</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Signed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>DocumentRef.Document</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorItems</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorServices</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/BankAccounts/BankAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BankAccounts</name>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Employees</owners>
  <owners>Catalog.Individuals</owners>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AccountTax</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Bank</name>
    <type>
      <types>CatalogRef.Banks</types>
    </type>
  </attributes>
  <attributes>
    <name>Correspondent</name>
    <type>
      <types>CatalogRef.Banks</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TreasuryCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>29</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/CommonModules/Dimensions/Module.bsl
Function GetParams () export
	
	p = new Structure ();
	p.Insert ( "Company" );
	p.Insert ( "Dim1" );
	p.Insert ( "Dim2" );
	p.Insert ( "Dim3" );
	p.Insert ( "Level" );
	return p;
	
EndFunction 

Procedure Choose ( Params, Item, StandardProcessing ) export
	
	value = Params [ "Dim" + Params.Level ];
	valueType = TypeOf ( value );
	if ( valueType = Type ( "CatalogRef.Departments" ) ) then
		redefined = chooseDepartment ( Params, Item, value );
	elsif ( valueType = Type ( "CatalogRef.Contracts" ) ) then
		redefined = chooseContract ( Params, Item, value );
	elsif ( valueType = Type ( "CatalogRef.BankAccounts" ) ) then
		redefined = chooseBankAccount ( Params, Item, value );
	elsif ( valueType = Type ( "CatalogRef.Warehouses" ) ) then
		redefined = chooseWarehouse ( Params, Item, value );
	else
		return;
	endif; 
	StandardProcessing = not redefined;
	
EndProcedure 

Function chooseDepartment ( Params, Item, Value )
	
	p = formParams ();
	p.CurrentRow = Value;
	p.Filter.Insert ( "Owner", Params.Company );
	OpenForm ( "Catalog.Departments.ChoiceForm", p, Item );
	return true;
	
EndFunction

Function formParams ()
	
	return new Structure ( "Filter, CurrentRow", new Structure () );
	
EndFunction 

Function chooseContract ( Params, Item, Value )
	
	p = formParams ();
	p.CurrentRow = Value;
	filter = p.Filter;
	setFilter ( filter, "Owner", findValue ( Params, Type ( "CatalogRef.Organizations" ) ) );
	setFilter ( filter, "Company", Params.Company );
	OpenForm ( "Catalog.Contracts.ChoiceForm", p, Item );
	return true;
	
EndFunction

Function findValue ( Params, Type )
	
	if ( Type = TypeOf ( Params.Dim1 ) ) then
		return Params.Dim1;
	elsif ( Type = TypeOf ( Params.Dim2 ) ) then
		return Params.Dim2;
	elsif ( Type = TypeOf ( Params.Dim3 ) ) then
		return Params.Dim3;
	endif; 
	
EndFunction 

Procedure setFilter ( Filter, Name, Value )

	if ( ValueIsFilled ( Value ) ) then
		Filter.Insert ( Name, Value );
	endif;
	
EndProcedure 

Function chooseBankAccount ( Params, Item, Value )
	
	p = formParams ();
	p.CurrentRow = Value;
	setFilter ( p.Filter, "Owner", Params.Company );
	OpenForm ( "Catalog.BankAccounts.ChoiceForm", p, Item );
	return true;
	
EndFunction

Function chooseWarehouse ( Params, Item, Value )
	
	p = formParams ();
	p.CurrentRow = Value;
	setFilter ( p.Filter, "Owner", Params.Company );
	OpenForm ( "Catalog.Warehouses.ChoiceForm", p, Item );
	return true;
	
EndFunction
